----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 16, 224, 224]             592
       BatchNorm2d-2         [-1, 16, 224, 224]              32
       DilatedConv-3         [-1, 16, 224, 224]               0
            Conv2d-4         [-1, 16, 111, 111]           2,320
       BatchNorm2d-5         [-1, 16, 111, 111]              32
       DilatedConv-6         [-1, 16, 111, 111]               0
            Conv2d-7          [-1, 128, 56, 56]          18,560
       BatchNorm2d-8          [-1, 128, 56, 56]             256
       DilatedConv-9          [-1, 128, 56, 56]               0
       DilatedNet-10          [-1, 128, 56, 56]               0
      BatchNorm2d-11          [-1, 128, 56, 56]             256
             ReLU-12          [-1, 128, 56, 56]               0
           Conv2d-13           [-1, 32, 56, 56]          36,864
        OSAModule-14           [-1, 32, 56, 56]               0
      BatchNorm2d-15           [-1, 32, 56, 56]              64
             ReLU-16           [-1, 32, 56, 56]               0
           Conv2d-17           [-1, 32, 56, 56]           9,216
        OSAModule-18           [-1, 32, 56, 56]               0
      BatchNorm2d-19           [-1, 32, 56, 56]              64
             ReLU-20           [-1, 32, 56, 56]               0
           Conv2d-21           [-1, 32, 56, 56]           9,216
        OSAModule-22           [-1, 32, 56, 56]               0
      BatchNorm2d-23           [-1, 32, 56, 56]              64
             ReLU-24           [-1, 32, 56, 56]               0
           Conv2d-25           [-1, 32, 56, 56]           9,216
        OSAModule-26           [-1, 32, 56, 56]               0
      BatchNorm2d-27           [-1, 32, 56, 56]              64
             ReLU-28           [-1, 32, 56, 56]               0
           Conv2d-29           [-1, 32, 56, 56]           9,216
        OSAModule-30           [-1, 32, 56, 56]               0
         OSABlock-31          [-1, 160, 56, 56]               0
      BatchNorm2d-32          [-1, 160, 56, 56]             320
             ReLU-33          [-1, 160, 56, 56]               0
           Conv2d-34           [-1, 64, 56, 56]          10,240
  TransitionBlock-35           [-1, 64, 56, 56]               0
      BatchNorm2d-36           [-1, 64, 56, 56]             128
             ReLU-37           [-1, 64, 56, 56]               0
           Conv2d-38           [-1, 40, 56, 56]          23,040
        OSAModule-39           [-1, 40, 56, 56]               0
      BatchNorm2d-40           [-1, 40, 56, 56]              80
             ReLU-41           [-1, 40, 56, 56]               0
           Conv2d-42           [-1, 40, 56, 56]          14,400
        OSAModule-43           [-1, 40, 56, 56]               0
      BatchNorm2d-44           [-1, 40, 56, 56]              80
             ReLU-45           [-1, 40, 56, 56]               0
           Conv2d-46           [-1, 40, 56, 56]          14,400
        OSAModule-47           [-1, 40, 56, 56]               0
      BatchNorm2d-48           [-1, 40, 56, 56]              80
             ReLU-49           [-1, 40, 56, 56]               0
           Conv2d-50           [-1, 40, 56, 56]          14,400
        OSAModule-51           [-1, 40, 56, 56]               0
      BatchNorm2d-52           [-1, 40, 56, 56]              80
             ReLU-53           [-1, 40, 56, 56]               0
           Conv2d-54           [-1, 40, 56, 56]          14,400
        OSAModule-55           [-1, 40, 56, 56]               0
         OSABlock-56          [-1, 200, 56, 56]               0
      BatchNorm2d-57          [-1, 200, 56, 56]             400
             ReLU-58          [-1, 200, 56, 56]               0
           Conv2d-59          [-1, 128, 56, 56]          25,600
  TransitionBlock-60          [-1, 128, 56, 56]               0
      BatchNorm2d-61          [-1, 128, 56, 56]             256
  ConvTranspose2d-62         [-1, 64, 113, 113]         131,136
      BatchNorm2d-63         [-1, 64, 113, 113]             128
  ConvTranspose2d-64         [-1, 32, 225, 225]          32,800
      BatchNorm2d-65         [-1, 32, 225, 225]              64
  ConvTranspose2d-66         [-1, 32, 225, 225]          82,976
          Dropout-67         [-1, 32, 225, 225]               0
           Conv2d-68          [-1, 1, 224, 224]             129
          Dropout-69         [-1, 32, 225, 225]               0
           Conv2d-70          [-1, 1, 224, 224]             129
          Dropout-71         [-1, 32, 225, 225]               0
           Conv2d-72          [-1, 1, 224, 224]             129
          Dropout-73         [-1, 32, 225, 225]               0
           Conv2d-74          [-1, 1, 224, 224]             129
================================================================
Total params: 461,556
Trainable params: 461,556
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.77
Forward/backward pass size (MB): 213.94
Params size (MB): 1.76
Estimated Total Size (MB): 216.47
----------------------------------------------------------------
